{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3104], "input_dtype": "int32", "sparse": false, "name": "main_input"}, "inbound_nodes": [], "name": "main_input"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_1", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 80448, "batch_input_shape": [null, 3104], "W_regularizer": null, "dropout": 0.0, "output_dim": 20, "input_length": 3104}, "inbound_nodes": [[["main_input", 0, 0]]], "name": "embedding_1"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 3104, 20], "sparse": false, "input_dtype": "float32", "name": "input_1"}, "name": "input_1"}, {"class_name": "Convolution1D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"input_length": null, "W_constraint": null, "b_constraint": null, "name": "convolution1d_1", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "glorot_uniform", "bias": true, "nb_filter": 20, "input_dim": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "border_mode": "same"}, "name": "convolution1d_1"}, {"class_name": "Flatten", "inbound_nodes": [[["convolution1d_1", 0, 0]]], "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["flatten_1", 0, 0]]}, "inbound_nodes": [[["embedding_1", 0, 0]]], "name": "model_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 62080, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 10}, "inbound_nodes": [[["model_1", 1, 0]]], "name": "dense_1"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "activation_1"}], "input_layers": [["main_input", 0, 0]], "output_layers": [["activation_1", 0, 0]], "name": "model_2"}}